In [2]:
import pandas as pd

In [3]:
data = [[1, 100], [2, 200], [3, 300]]
employee = pd.DataFrame(data, columns=['id', 'salary']).astype({'id':'int64', 'salary':'int64'})

In [8]:
employee

   id  salary
0   1     100
1   2     200
2   3     300

In [10]:
max_value = employee['salary'].max()

In [11]:
print(max_value)

300

In [12]:
def highest_salary(employee):
    return employee['salary'].max()

In [13]:
highest_salary(employee)

300

In [26]:
def second_highest_salary(employee):
    unique_salaries = employee['salary'].unique()
    second_highest = sorted(unique_salaries)[-2]
    if len(unique_salaries) < 2:
        return pd.DataFrame({'second_highest_salary': [None]})
    else: 
        return pd.DataFrame({'second_highest_salary': [second_highest]})

In [27]:
second_highest_salary(employee)

   second_highest_salary
0                    200